In [1]:
#We can also handle data from daabases using pandas
#For this case, we will be using sqllite as our database

import sqlite3 as sqlite
import pandas as pd
import numpy as np
from pandas import DataFrame

In [2]:
#Creating a query 

query = """
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20),
     c REAL, d INTEGER
    );
"""

In [3]:
#Connecting to the database with memory i.e. the database will reside in RAM instead of on disk
con = sqlite.connect(':memory:')

In [4]:
#Executing the query on the database
#First it creates a cursor object which would be used throughout the database
#After that the cursor executes the SQL statement passed as query to the database
con.execute(query)

In [5]:
#Commiting to the database connection so that the changes can be seen by other db connections
con.commit()

In [6]:
#Creating data to insert into the database
data = [('Andrew','Garfield',12.5,21),
        ('John','Phillips',13.7,32),
        ('Dough','Don',41.6,78)]

In [7]:
#Creating insert statement to be executed by the database
stmnt = "INSERT INTO test VALUES(?,?,?,?)"

In [8]:
#Executing the statement for all entries in data
con.executemany(stmnt, data)

In [9]:
con.commit()

In [10]:
#Executing the SELECT query
#In case of python SQLdrivers, the data is usually in a list of tuples

#The cursor will execute the select all query on the test table
cursor = con.execute('select * from test')

In [11]:
rows = cursor.fetchall() #Fetches all datas in the rows of a table and returns as a list of tuples

In [12]:
rows #Displays the data in the table

[('Andrew', 'Garfield', 12.5, 21),
 ('John', 'Phillips', 13.7, 32),
 ('Dough', 'Don', 41.6, 78)]

In [13]:
cursor.description #Describes the column values for a result

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [14]:
#Storing rows as rows in dataframe and the first element of each tuple in description list as indexes
db_df = DataFrame(rows, columns = list(zip(*cursor.description))[0])

In [15]:
db_df

        a         b     c   d
0  Andrew  Garfield  12.5  21
1    John  Phillips  13.7  32
2   Dough       Don  41.6  78

In [16]:
#Another method of creating dataframe using the database data is by simply using read_sql method from pandas sql module

import pandas.io.sql as sql

sql.read_sql('select * from test', con) #Reads SQL query into a dataframe

        a         b     c   d
0  Andrew  Garfield  12.5  21
1    John  Phillips  13.7  32
2   Dough       Don  41.6  78